app/Http/Controllers/Api/UsersController.php

select * from `links` where `links`.`user_id` in ('129')
select * from `references` where `references`.`freelancer_id` in ('129')
select * from `users` where `id` = '129' limit 1
select `agencies`.*, `agency_user`.`user_id` as `pivot_user_id`, `agency_user`.`agency_id` as `pivot_agency_id` from `agencies` inner join `agency_user` on `agencies`.`id` = `agency_user`.`agency_id` where `agency_user`.`user_id` in ('129')
---
    public function fetch(Request $request, User $user) {
        $fullUser = User::where("id", $user->id)->with(
            "clientJobs",
            "freelancerJobs",
            "agencies",
            "skills",
            "references",
            "ownedAgencies",
            "agencies.freelancers",
            "ownedAgencies.freelancers",
            'recommendedUsers',
            'recommendedUsers.owner',
            'recommendedUsers.freelancer',
            'recommendations.owner',
            'recommendations.freelancer',
            'links'
        )->first();