app/User.php

select Date(created_at) as date, COUNT(*) as "views" from `views` where `created_at` >= '2018-04-10' and `user_id` = '129' group by `date` order by `date` asc
---
    public function getRecentViewsAttribute(  )
    {
        $startDate = Carbon::now()->subWeeks(12)->toDateString();
        $views = \App\View::where('created_at',">=", $startDate)
            ->where('user_id', $this->id)
            ->groupBy( 'date' )
            ->orderBy( 'date', 'ASC' )
            ->get( array(
                \DB::raw( 'Date(created_at) as date' ),
                \DB::raw( 'COUNT(*) as "views"' )
            ));