app/Http/Controllers/ProfileController.php

    public function dashboard()
    {
        $user = \App\User::where("id",\Auth::user()->id)->with(
            "clientJobs",
            "freelancerJobs",
            "agencies",
            "links",
            "skills",
            "references",
            "ownedAgencies",
            "agencies.freelancers",
            "ownedAgencies.freelancers",
            'recommendedUsers',
            'recommendedUsers.owner',
            'recommendedUsers.freelancer',
            'recommendations.owner',
            'recommendations.freelancer'
        )->first();


        /* If the user is logging in for the first time and they are a freelancer, redirect them to the profile wizard */
        if (isset( $user->meta['first_login']) && $user->meta['first_login'] == true) {
            $user->setMeta( 'first_login', false );
            $user->save();
---
select * from `links` where `links`.`user_id` in ('128')
select * from `references` where `references`.`freelancer_id` in ('128')
select * from `users` where `id` = '128' limit 1
select `agencies`.*, `agency_user`.`user_id` as `pivot_user_id`, `agency_user`.`agency_id` as `pivot_agency_id` from `agencies` inner join `agency_user` on `agencies`.`id` = `agency_user`.`agency_id` where `agency_user`.`user_id` in ('128')
update `users` set `meta` = '{\"first_login\":false,\"profile_wizard_complete\":false,\"dashboard_tour_compelte\":false,\"freelancer_tour_complete\":false,\"client_tour_complete\":false}', `updated_at` = '2018-07-03 13:52:06' where `id` = '128'

    public function profileWizard()
    {
        $user = \App\User::where( "id", \Auth::user()->id )->with(
            "clientJobs",
            "freelancerJobs",
            "agencies",
            "references",
            "ownedAgencies",
            "agencies.freelancers",
            "ownedAgencies.freelancers",
            'recommendedUsers',
            'recommendedUsers.owner',
            'recommendedUsers.freelancer',
            'recommendations.owner',
            'recommendations.freelancer'
        )->first();
---
select * from `references` where `references`.`freelancer_id` in ('129')
select * from `users` where `id` = '129' limit 1
select `agencies`.*, `agency_user`.`user_id` as `pivot_user_id`, `agency_user`.`agency_id` as `pivot_agency_id` from `agencies` inner join `agency_user` on `agencies`.`id` = `agency_user`.`agency_id` where `agency_user`.`user_id` in ('129')

    public function downloadToPdf( Request $request, $userId){
        // /* Only allow admin users to download any user's profile */
        if ( !\Auth::user()->isAdmin() ) {
            return redirect( "/dashboard" );
        }
        //
        $user = \App\User::where("id", $userId)->with(
            "clientJobs",
            "freelancerJobs",
            "agencies",
            "links",
            "skills",
            "references",
            "ownedAgencies",
            "agencies.freelancers",
            "ownedAgencies.freelancers",
            'recommendedUsers',
            'recommendedUsers.owner',
            'recommendedUsers.freelancer',
            'recommendations.owner',
            'recommendations.freelancer'
        )->first();
---
select * from `links` where `links`.`user_id` in ('117')
select * from `references` where `references`.`freelancer_id` in ('117')
select * from `users` where `id` = '117' limit 1
select `agencies`.*, `agency_user`.`user_id` as `pivot_user_id`, `agency_user`.`agency_id` as `pivot_agency_id` from `agencies` inner join `agency_user` on `agencies`.`id` = `agency_user`.`agency_id` where `agency_user`.`user_id` in ('117')